[{"title": "NASA Establishes Board to Initially Review Mars Sample Return Plans", "preview": "The board will assist with analysis of current plans and goals for one of the most difficult missions humanity has ever undertaken."}, {"title": "NASA to Hold Mars 2020 Perseverance Rover Launch Briefing", "preview": "Learn more about the agency's next Red Planet mission during a live event on June 17."}, {"title": "NASA's InSight 'Hears' Peculiar Sounds on Mars", "preview": "Listen to the marsquakes and other, less-expected sounds that the Mars lander has been detecting."}, {"title": "Screening Soon: 'The Pathfinders' Trains Lens on Mars", "preview": "With the Mars 2020 mission ramping up, the documentary — the first of four about past JPL missions to the Red Planet to be shown at Caltech — tells a gripping backstory."}, {"title": "NASA's Push to Save the Mars InSight Lander's Heat Probe", "preview": "The scoop on the end of the spacecraft's robotic arm will be used to 'pin' the mole against the wall of its hole."}, {"title": "NASA's Mars 2020 Rover Goes Coast-to-Coast to Prep for Launch", "preview": "The agency's first step in returning rocks from Mars just arrived at Kennedy Space Center. The Mars 2020 team now begins readying for a launch to the Red Planet this July."}, {"title": "NASA's Mars 2020 Rover Tests Descent-Stage Separation", "preview": "A crane lifts the rocket-powered descent stage away from NASA's Mars 2020 rover after technicians tested the pyrotechnic charges that separate the two spacecraft."}, {"title": "Alabama High School Student Names NASA's Mars Helicopter", "preview": "Vaneeza Rupani's essay was chosen as the name for the small spacecraft, which will mark NASA's first attempt at powered flight on another planet."}, {"title": "NASA's MAVEN Observes Martian Night Sky Pulsing in Ultraviolet Light", "preview": "Vast areas of the Martian night sky pulse in ultraviolet light, according to images from NASA’s MAVEN spacecraft. The results are being used to illuminate complex circulation patterns in the Martian atmosphere."}, {"title": "Nine Finalists Chosen in NASA's Mars 2020 Rover Naming Contest", "preview": "Nine finalists have been chosen in the essay contest for K-12 students across U.S. to name NASA's next Mars rover. Now you can help by voting for your favorite. "}, {"title": "NASA's Perseverance Rover Bringing 3D-Printed Metal Parts to Mars", "preview": "For hobbyists and makers, 3D printing expands creative possibilities; for specialized engineers, it's also key to next-generation spacecraft design."}, {"title": "What's Mars Solar Conjunction, and Why Does It Matter?", "preview": "NASA spacecraft at Mars are going to be on their own for a few weeks when the Sun comes between Mars and Earth, interrupting communications."}, {"title": "Virginia Middle School Student Earns Honor of Naming NASA's Next Mars Rover", "preview": "NASA chose a seventh-grader from Virginia as winner of the agency's \"Name the Rover\" essay contest. Alexander Mather's entry for \"Perseverance\" was voted tops among 28,000 entries. "}, {"title": "Meet the People Behind NASA's Perseverance Rover", "preview": "These are the scientists and engineers who built NASA's next Mars rover and who will guide it to a safe landing in Jezero Crater. "}, {"title": "From JPL's Mailroom to Mars and Beyond", "preview": "Bill Allen has thrived as the mechanical systems design lead for three Mars rover missions, but he got his start as a teenager sorting letters for the NASA center."}]